tutorials/multiphaseReactiveTransport/interReactiveTransportFoam/2DGrainstonesMultiphaseReactiveTransport/constant/thermoPhysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermoPhysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Phase1 phreeqcMixture;
Phase2 inertMultiComponentMixture;

solutionSpecies
{
	Ca+2
	{
		D1 D1 [ 0 2 -1 0 0 0 0 ] 1e-9;
		D2 D2 [ 0 2 -1 0 0 0 0 ] 1e-9;
		H H [ 0 0 0 0 0 0 0 ] 1e-4;
                Mw Mw [1 0 0 0 -1 0 0] 40;
	}

	Cl-
	{
		D1 D1 [ 0 2 -1 0 0 0 0 ] 1e-9;
		D2 D2 [ 0 2 -1 0 0 0 0 ] 1e-9;
		H H [ 0 0 0 0 0 0 0 ] 1e-4;
                Mw Mw [1 0 0 0 -1 0 0] 35;
	}

	H+
	{
		D1 D1 [ 0 2 -1 0 0 0 0 ] 1e-9;
		D2 D2 [ 0 2 -1 0 0 0 0 ] 1e-9;
		H H [ 0 0 0 0 0 0 0 ] 1e-4;
                Mw Mw [1 0 0 0 -1 0 0] 1;
	}


	OH-
	{
		D1 D1 [ 0 2 -1 0 0 0 0 ] 1e-9;
		D2 D2 [ 0 2 -1 0 0 0 0 ] 1e-9;
		H H [ 0 0 0 0 0 0 0 ] 1e-4;
                Mw Mw [1 0 0 0 -1 0 0] 17;
	}


};

surfaceSpecies
{
	Surf_a-;
	Surf_aCa+;
	Surf_aH;
};


surfaceMasters
{
      Surf_a;
}

// ************************************************************************* //
